{
  "modelTopology": {
    "keras_version": "2.1.6",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "name": "input_1",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, null, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "inbound_nodes": []
          },
          {
            "name": "conv2d_1",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_1",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_1",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_1",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]
          },
          {
            "name": "conv2d_2",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_2",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_2",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_2",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]
          },
          {
            "name": "conv2d_3",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_3",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_3",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_3",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]
          },
          {
            "name": "conv2d_4",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_4",
              "trainable": true,
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_4",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_4",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_4",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_4",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]
          },
          {
            "name": "conv2d_5",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_5",
              "trainable": true,
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_5",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_5",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_5",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_5",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]
          },
          {
            "name": "conv2d_6",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_6",
              "trainable": true,
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_6",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_6",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]
          },
          {
            "name": "max_pooling2d_6",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_6",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [1, 1],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]
          },
          {
            "name": "conv2d_7",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_7",
              "trainable": true,
              "filters": 1024,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_7",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_7",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]
          },
          {
            "name": "conv2d_8",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_8",
              "trainable": true,
              "filters": 256,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_8",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_8",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]
          },
          {
            "name": "conv2d_11",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_11",
              "trainable": true,
              "filters": 128,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_10",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_10",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]
          },
          {
            "name": "up_sampling2d_1",
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_1",
              "trainable": true,
              "size": [2, 2],
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]
          },
          {
            "name": "concatenate_1",
            "class_name": "Concatenate",
            "config": {"name": "concatenate_1", "trainable": true, "axis": -1},
            "inbound_nodes": [
              [["up_sampling2d_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]
            ]
          },
          {
            "name": "conv2d_9",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_9",
              "trainable": true,
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]
          },
          {
            "name": "conv2d_12",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_12",
              "trainable": true,
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_9",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_9",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]
          },
          {
            "name": "leaky_re_lu_11",
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_11",
              "trainable": true,
              "alpha": 0.10000000149011612
            },
            "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]
          },
          {
            "name": "conv2d_10",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_10",
              "trainable": true,
              "filters": 255,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]
          },
          {
            "name": "conv2d_13",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_13",
              "trainable": true,
              "filters": 255,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {"l1": 0, "l2": 0.0005000000237487257}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [["conv2d_10", 0, 0], ["conv2d_13", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group2-shard1of1"],
      "weights": [
        {
          "name": "conv2d_10/kernel",
          "shape": [1, 1, 512, 255],
          "dtype": "float32"
        },
        {"name": "conv2d_10/bias", "shape": [255], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group3-shard1of1"],
      "weights": [
        {
          "name": "conv2d_11/kernel",
          "shape": [1, 1, 256, 128],
          "dtype": "float32"
        },
        {"name": "conv2d_11/bias", "shape": [128], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group4-shard1of1"],
      "weights": [
        {
          "name": "conv2d_12/kernel",
          "shape": [3, 3, 384, 256],
          "dtype": "float32"
        },
        {"name": "conv2d_12/bias", "shape": [256], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group5-shard1of1"],
      "weights": [
        {
          "name": "conv2d_13/kernel",
          "shape": [1, 1, 256, 255],
          "dtype": "float32"
        },
        {"name": "conv2d_13/bias", "shape": [255], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group6-shard1of1"],
      "weights": [
        {
          "name": "conv2d_2/kernel",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group7-shard1of1"],
      "weights": [
        {
          "name": "conv2d_3/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group8-shard1of1"],
      "weights": [
        {
          "name": "conv2d_4/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group9-shard1of1"],
      "weights": [
        {
          "name": "conv2d_5/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group10-shard1of2", "group10-shard2of2"],
      "weights": [
        {
          "name": "conv2d_6/kernel",
          "shape": [3, 3, 256, 512],
          "dtype": "float32"
        },
        {"name": "conv2d_6/bias", "shape": [512], "dtype": "float32"}
      ]
    },
    {
      "paths": [
        "group11-shard1of5",
        "group11-shard2of5",
        "group11-shard3of5",
        "group11-shard4of5",
        "group11-shard5of5"
      ],
      "weights": [
        {
          "name": "conv2d_7/kernel",
          "shape": [3, 3, 512, 1024],
          "dtype": "float32"
        },
        {"name": "conv2d_7/bias", "shape": [1024], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group12-shard1of1"],
      "weights": [
        {
          "name": "conv2d_8/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        {"name": "conv2d_8/bias", "shape": [256], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group13-shard1of2", "group13-shard2of2"],
      "weights": [
        {
          "name": "conv2d_9/kernel",
          "shape": [3, 3, 256, 512],
          "dtype": "float32"
        },
        {"name": "conv2d_9/bias", "shape": [512], "dtype": "float32"}
      ]
    }
  ]
}