{"modelTopology": {"training_config": {"metrics": [], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.009999999776482582, "rho": 0.8999999761581421, "decay": 0.0}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.1.5", "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "batch_input_shape": [null, 40, 57], "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 57, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [128, 57], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [57], "name": "dense_3/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [57, 512], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [128, 512], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [512], "name": "lstm_2/bias"}]}]}